; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v1 - type_3 ?v6 - type_2)
 	      (pred_3 ?v3 - object ?v6 - type_2)
	      (pred_1 ?v1 - type_3 ?v8 - type_1)
	      (pred_2 ?v1 - type_3 ?v3 - object ?v8 - type_1))

   (:action op_3
       :parameters  (?v1 - type_3 ?v7 ?v5 - type_2)
       :precondition (and  (pred_4 ?v1 ?v7))
       :effect (and  (pred_4 ?v1 ?v5)
		     (not (pred_4 ?v1 ?v7))))

   (:action op_1
       :parameters (?v1 - type_3 ?v4 - object ?v2 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_3 ?v4 ?v2) (pred_4 ?v1 ?v2) (pred_1 ?v1 ?v8))
       :effect (and (pred_2 ?v1 ?v4 ?v8)
		    (not (pred_3 ?v4 ?v2)) 
		    (not (pred_1 ?v1 ?v8))))

   (:action op_2
       :parameters (?v1 - type_3 ?v4 - object ?v2 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_2 ?v1 ?v4 ?v8) (pred_4 ?v1 ?v2))
       :effect (and (pred_3 ?v4 ?v2)
		    (pred_1 ?v1 ?v8)
		    (not (pred_2 ?v1 ?v4 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_09 obj_10 - type_3
obj_03 obj_01 obj_11 obj_13 - type_1
obj_08 obj_02 obj_07 obj_04 - type_2
obj_06 obj_12 obj_05 - object)
(:init
(pred_4 obj_09 obj_02)
(pred_1 obj_09 obj_03)
(pred_1 obj_09 obj_01)
(pred_4 obj_10 obj_02)
(pred_1 obj_10 obj_11)
(pred_1 obj_10 obj_13)
(pred_3 obj_06 obj_08)
(pred_3 obj_12 obj_08)
(pred_3 obj_05 obj_02)
)
(:goal
(and
(pred_3 obj_06 obj_07)
(pred_3 obj_12 obj_08)
(pred_3 obj_05 obj_08)
)
)

(:constraints
  (always (not (pred_4 obj_09 obj_07)))
)
)

; plan
1. (op_1 obj_09 obj_05 obj_02 obj_01)
   deleted: (pred_3 obj_05 obj_02) (pred_1 obj_09 obj_01)
   added: (pred_2 obj_09 obj_05 obj_01)
   goals met: 1 of 3
2. (op_3 obj_10 obj_02 obj_08)
   deleted: (pred_4 obj_10 obj_02)
   added: (pred_4 obj_10 obj_08)
   goals met: 1 of 3
3. (op_3 obj_09 obj_02 obj_08)
   deleted: (pred_4 obj_09 obj_02)
   added: (pred_4 obj_09 obj_08)
   goals met: 1 of 3
4. (op_1 obj_09 obj_06 obj_08 obj_03)
   deleted: (pred_3 obj_06 obj_08) (pred_1 obj_09 obj_03)
   added: (pred_2 obj_09 obj_06 obj_03)
   goals met: 1 of 3
5. (op_2 obj_09 obj_05 obj_08 obj_01)
   deleted: (pred_2 obj_09 obj_05 obj_01)
   added: (pred_3 obj_05 obj_08) (pred_1 obj_09 obj_01)
   goals met: 2 of 3
6. (op_2 obj_09 obj_06 obj_08 obj_03)
   deleted: (pred_2 obj_09 obj_06 obj_03)
   added: (pred_3 obj_06 obj_08) (pred_1 obj_09 obj_03)
   goals met: 2 of 3
7. (op_1 obj_10 obj_06 obj_08 obj_13)
   deleted: (pred_3 obj_06 obj_08) (pred_1 obj_10 obj_13)
   added: (pred_2 obj_10 obj_06 obj_13)
   goals met: 2 of 3
8. (op_3 obj_10 obj_08 obj_07)
   deleted: (pred_4 obj_10 obj_08)
   added: (pred_4 obj_10 obj_07)
   goals met: 2 of 3
9. (op_2 obj_10 obj_06 obj_07 obj_13)
   deleted: (pred_2 obj_10 obj_06 obj_13)
   added: (pred_3 obj_06 obj_07) (pred_1 obj_10 obj_13)
   goals met: 3 of 3
